---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoAppropriateGroup
source: html/b1d790c0-c726-5c22-2b91-b728259b2acc.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.NoAppropriateGroup Property

There is no Group that can be placed in the current view.

## Syntax (C#)
```csharp
public static FailureDefinitionId NoAppropriateGroup { get; }
```